1.2.4 DistributedServices.Host/Log/2020_02_05_LogTrazaStd.txt

[Datos Generales]
Identificador="6fb6d553-2f2f-48b6-aab1-494c330454bf"
Fecha y Hora="02/05/2020 22:02:47"
Título="ServicioIncidencia"
Detalle=""
Acciones=""
Comentarios=""
[Datos Adicionales]

[Request]
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <To s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://localhost:56904/GestionSeguridadService.svc</To>
    <Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">PROMPERU.GestionSeguridadService/IGestionSeguridadService/UsuarioListarMenu</Action>
  </s:Header>
  <s:Body>
    <UsuarioListarMenu xmlns="PROMPERU.GestionSeguridadService">
      <usuarioId>1</usuarioId>
    </UsuarioListarMenu>
  </s:Body>
</s:Envelope>


[Response]
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header />
  <s:Body>
    <s:Fault>
      <faultcode>s:ErrorBaseDatos</faultcode>
      <faultstring xml:lang="es-PE">Error relacionado con la red o específico de la instancia mientras se establecía una conexión con el servidor SQL Server. No se encontró el servidor o éste no estaba accesible. Compruebe que el nombre de la instancia es correcto y que SQL Server está configurado para admitir conexiones remotas. (provider: Named Pipes Provider, error: 40 - No se pudo abrir una conexión con SQL Server)</faultstring>
      <detail>
        <ServiceErrorResponseDto xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://schemas.datacontract.org/2004/07/PROMPERU.YTQPRutasCortas.Application.Dto.Fault">
          <Code>0001</Code>
          <Description>Error relacionado con la red o específico de la instancia mientras se establecía una conexión con el servidor SQL Server. No se encontró el servidor o éste no estaba accesible. Compruebe que el nombre de la instancia es correcto y que SQL Server está configurado para admitir conexiones remotas. (provider: Named Pipes Provider, error: 40 - No se pudo abrir una conexión con SQL Server)</Description>
          <Message>Error relacionado con la red o específico de la instancia mientras se establecía una conexión con el servidor SQL Server. No se encontró el servidor o éste no estaba accesible. Compruebe que el nombre de la instancia es correcto y que SQL Server está configurado para admitir conexiones remotas. (provider: Named Pipes Provider, error: 40 - No se pudo abrir una conexión con SQL Server)</Message>
          <SubCode>ErrorBaseDatos</SubCode>
          <Type>ErrorBaseDatos</Type>
        </ServiceErrorResponseDto>
      </detail>
    </s:Fault>
  </s:Body>
</s:Envelope>


